[
  {
    "id": "finance",
    "name": "Finance",
    "description": "Manage our budget, secure funding through grants and sponsorships, and ensure financial sustainability.",
    "responsibilities": [
      "Grant writing and fundraising campaigns",
      "Budget tracking and financial reporting",
      "Revenue stream development"
    ],
    "requiresApplication": true,
    "learnMoreContent": {
      "teams": [
        {
          "name": "Development",
          "description": "Secure sustainable funding and drive revenue growth",
          "responsibilities": [
            "Identify and pursue grant opportunities to secure sustainable funding",
            "Plan and execute fundraising campaigns and events to support chapter operations",
            "Develop creative revenue streams to strengthen BinaryHeart's financial sustainability"
          ]
        },
        {
          "name": "Compliance",
          "description": "Ensure financial transparency and accurate reporting",
          "responsibilities": [
            "Track financial activity including income, expenses, receipts, reimbursements, and inventory valuation",
            "Develop and maintain chapter budget tracking procedures for transparency and accountability",
            "Ensure timely, accurate monthly reports and provide clean data"
          ]
        }
      ],
      "skillsYoullGain": "Financial analysis, grant writing, budget management, Excel/Google Sheets proficiency, professional communication, fundraising strategy, and nonprofit finance operations.",
      "idealFor": "Students interested in business, accounting, nonprofit management, or anyone looking to develop strong analytical and organizational skills."
    }
  },
  {
    "id": "marketing",
    "name": "Marketing",
    "description": "Spread the word about our mission through media production, communications, and strategic partnerships.",
    "responsibilities": [
      "Photo and video content production",
      "Public-facing documents and marketing materials",
      "Partner and sponsor relationship management"
    ],
    "requiresApplication": true,
    "learnMoreContent": {
      "teams": [
        {
          "name": "Media",
          "description": "Produce high-quality visual content and storytelling",
          "responsibilities": [
            "Produce high-quality photo and video content at events",
            "Film and produce tech literacy programming and high-impact commercial advertising",
            "Create public-facing content for social impact causes"
          ]
        },
        {
          "name": "Communications",
          "description": "Represent BinaryHeart and create compelling marketing materials",
          "responsibilities": [
            "Represent BinaryHeart at partner events and be the face of the organization",
            "Oversee public-facing documents including yearly impact reports, newsletters, and donor pitch decks",
            "Create marketing materials such as flyers and graphics, and write content for BinaryHeart on digital platforms like LinkedIn"
          ]
        },
        {
          "name": "External Relations",
          "description": "Build and maintain organizational partnerships",
          "responsibilities": [
            "Manage and maintain all organizational partners, including sponsors, affiliates, and partners",
            "Gain experience in client relationship management, and outreach",
            "Acquire event partnerships, contacts, and build a professional network"
          ]
        }
      ],
      "skillsYoullGain": "Social media marketing, graphic design, content creation, brand management, public relations, and digital communications. You'll learn industry-standard tools and build a portfolio of real work.",
      "idealFor": "Creative students interested in marketing, communications, journalism, or design. Perfect for anyone who loves storytelling and connecting with audiences."
    }
  },
  {
    "id": "operations",
    "name": "Operations",
    "description": "Work hands-on with computers—source devices, refurbish and repair, and distribute to those in need.",
    "responsibilities": [
      "Device sourcing and donation drives",
      "Computer refurbishment and repair",
      "Distribution and recipient support",
      "Open to all—no application needed!"
    ],
    "requiresApplication": false,
    "learnMoreContent": {
      "teams": [
        {
          "name": "Sourcing",
          "description": "Secure device donations and organize collection efforts",
          "responsibilities": [
            "Secure device donations from individuals, schools, and corporate partners",
            "Organize and run donation drives and pickups",
            "Ensure the refurbishment team has a steady flow of incoming devices"
          ]
        },
        {
          "name": "Refurbishment",
          "description": "Repair, upgrade, and prepare computers for distribution",
          "responsibilities": [
            "Wipe devices securely and repair/upgrade hardware",
            "Install standard software for reliable, ready-to-use computers",
            "Train and coordinate volunteers to follow consistent repair workflows"
          ]
        },
        {
          "name": "Distribution",
          "description": "Allocate devices and support recipients",
          "responsibilities": [
            "Manage applications and vet recipients (individuals & organizations)",
            "Allocate devices fairly and deliver with proper setup/training resources",
            "Collect feedback and track impact from device recipients"
          ]
        }
      ],
      "skillsYoullGain": "Hardware troubleshooting, software installation, inventory management, quality control, and technical documentation. You'll develop practical IT skills that are directly applicable to careers in technology support, systems administration, and computer repair.",
      "idealFor": "Hands-on learners, tech enthusiasts, and anyone wanting practical experience with computer hardware and software. No prior experience required—just curiosity and a willingness to learn! Perfect for students interested in IT, computer science, or anyone who wants to make a tangible impact in their community."
    }
  },
  {
    "id": "membership",
    "name": "Membership",
    "description": "Build and sustain a strong, inclusive volunteer community where every member feels valued, connected, and engaged in BinaryHeart's mission.",
    "responsibilities": [
      "Community engagement and chapter-wide events",
      "Professional development and skills workshops",
      "Creative workshops and hands-on activities",
      "Open to all—no application needed!"
    ],
    "requiresApplication": false,
    "learnMoreContent": {
      "teams": [],
      "skillsYoullGain": "Event management, community building, policy administration, leadership development, and organizational communication. You'll learn how to cultivate an inclusive chapter culture while ensuring operational excellence and regulatory compliance.",
      "idealFor": "People-oriented students, aspiring leaders, and anyone interested in organizational development and community engagement. Perfect for those who want to shape chapter culture, build meaningful connections, and ensure Binary Heart at IU remains a welcoming, effective, and compliant organization."
    }
  }
]
